{
	"quotes": [
		{
			"quote": "The only way to do great work is to love what you do.",
			"author": "Steve Jobs"
		},
		{
			"quote": "Success is not final, failure is not fatal: It is the courage to continue that counts.",
			"author": "Winston Churchill"
		},
		{
			"quote": "Believe you can and you're halfway there.",
			"author": "Theodore Roosevelt"
		},
		{
			"quote": "Your time is limited, so don't waste it living someone else's life.",
			"author": "Steve Jobs"
		},
		{
			"quote": "Hardships often prepare ordinary people for an extraordinary destiny.",
			"author": "C.S. Lewis"
		},
		{
			"quote": "It does not matter how slowly you go as long as you do not stop.",
			"author": "Confucius"
		},
		{
			"quote": "Everything you’ve ever wanted is on the other side of fear.",
			"author": "George Addair"
		},
		{
			"quote": "Success usually comes to those who are too busy to be looking for it.",
			"author": "Henry David Thoreau"
		},
		{
			"quote": "Don't watch the clock; do what it does. Keep going.",
			"author": "Sam Levenson"
		},
		{
			"quote": "The future depends on what you do today.",
			"author": "Mahatma Gandhi"
		},
		{
			"quote": "Start where you are. Use what you have. Do what you can.",
			"author": "Arthur Ashe"
		},
		{
			"quote": "Dream big and dare to fail.",
			"author": "Norman Vaughan"
		},
		{
			"quote": "Opportunities don't happen. You create them.",
			"author": "Chris Grosser"
		},
		{
			"quote": "If you want to achieve greatness stop asking for permission.",
			"author": "Anonymous"
		},
		{
			"quote": "Push yourself, because no one else is going to do it for you.",
			"author": "Anonymous"
		},
		{
			"quote": "Great things never come from comfort zones.",
			"author": "Anonymous"
		},
		{
			"quote": "Do something today that your future self will thank you for.",
			"author": "Sean Patrick Flanery"
		},
		{
			"quote": "Don’t wait. The time will never be just right.",
			"author": "Napoleon Hill"
		},
		{
			"quote": "It always seems impossible until it’s done.",
			"author": "Nelson Mandela"
		},
		{
			"quote": "Keep your face always toward the sunshine—and shadows will fall behind you.",
			"author": "Walt Whitman"
		},
		{
			"quote": "Strive not to be a success, but rather to be of value.",
			"author": "Albert Einstein"
		},
		{
			"quote": "I am not a product of my circumstances. I am a product of my decisions.",
			"author": "Stephen Covey"
		},
		{
			"quote": "What you get by achieving your goals is not as important as what you become by achieving your goals.",
			"author": "Zig Ziglar"
		},
		{
			"quote": "Do not wait to strike till the iron is hot; but make it hot by striking.",
			"author": "William Butler Yeats"
		},
		{
			"quote": "The harder you work for something, the greater you'll feel when you achieve it.",
			"author": "Anonymous"
		}
	]
}
